import numpy as np
import matplotlib.pyplot as mll             #импортируем библиотеки numpy и matplotlib
#---------------------------------------------------------------------
x = np.linspace(0,50,1000)                  #задаем длину функции по иксу (область определения функции)
y = x**3 - 6*x**2 + 11*x - 6                #сама функция
#---------------------------------------------------------------------
mll.plot(x, y)                              #создание графика
mll.show()                                  #вывод его на экран
